JosAlc67/DimecaProject/esp32_triple_as5600/Fase7_Integracion_Final/Fase7_Integracion_Final.ino
  as5600_2.getCumulativePosition(true);
  comOk2 = (as5600_2.lastError() == 0);

  comOk3 = actualizarPosicion3();
}

void imprimirPosicion(const char *nombre, bool ok, int32_t posicionRaw, int32_t vueltas, bool imanOk) {
  if (!ok) {
    Serial.print(nombre);
    Serial.println(": SIN COMUNICACION I2C");
    return;
  }
  int32_t dentroDeVuelta = posicionRaw % 4096;
  if (dentroDeVuelta < 0) dentroDeVuelta += 4096;
  float anguloDentroDeVuelta = dentroDeVuelta * 360.0f / 4096.0f;
  float anguloAcumulado = posicionRaw * 360.0f / 4096.0f;

  Serial.print(nombre);
  Serial.print(": ");
  Serial.print(anguloDentroDeVuelta, 2);
  Serial.print(" deg (vuelta actual) | vueltas=");
  Serial.print(vueltas);
  Serial.print(" | acumulado=");
  Serial.print(anguloAcumulado, 2);
  Serial.print(" deg");
  if (!imanOk) Serial.print("  (SIN IMAN)");
  Serial.println();
}

// Calibra el sensor `indice` (1, 2 o 3) para que la posicion FISICA actual
// del eje pase a leerse como 0 grados Y como 0 vueltas. offsetRaw =
// (4096 - crudo) & 0x0FFF es el mismo truco de complemento a 2 en 12 bits
// que usa internamente AS5600::setOffset() para offsets negativos
// (verificado en el codigo fuente de la libreria): sumar ese offset y
// enmascarar a 12 bits equivale a restar el valor crudo original, sin
// importar el signo. Tras fijar el offset, se resincroniza el contador de
// vueltas a 0 en ese mismo punto - si no se hiciera esto, el cambio de
// offset se interpretaria como un salto fisico y corromperia el conteo.
void calibrarSensor(uint8_t indice) {
  if (indice == 1) {
    as5600_1.setOffset(0);
    uint16_t crudo = as5600_1.readAngle();
    if (as5600_1.lastError() != 0) {
      Serial.println("ERROR: no se pudo leer AS5600 #1 para calibrar.");
      return;
    }
    int16_t offsetRaw = (4096 - crudo) & 0x0FFF;
    as5600_1.setOffset(offsetRaw * AS5600_RAW_TO_DEGREES);
    as5600_1.resetCumulativePosition(0);
    guardarOffsetRaw(1, offsetRaw);
    Serial.println("AS5600 #1 calibrado: posicion actual = 0.00 deg, 0 vueltas (offset guardado en flash).");
  } else if (indice == 2) {
    as5600_2.setOffset(0);
    uint16_t crudo = as5600_2.readAngle();
    if (as5600_2.lastError() != 0) {
      Serial.println("ERROR: no se pudo leer AS5600 #2 para calibrar.");
      return;
    }
    int16_t offsetRaw = (4096 - crudo) & 0x0FFF;
    as5600_2.setOffset(offsetRaw * AS5600_RAW_TO_DEGREES);
    as5600_2.resetCumulativePosition(0);
    guardarOffsetRaw(2, offsetRaw);
    Serial.println("AS5600 #2 calibrado: posicion actual = 0.00 deg, 0 vueltas (offset guardado en flash).");
  } else if (indice == 3) {
    uint16_t crudo;
    if (!leerReg16_bus3(AS5600_REG_ANGLE, crudo)) {
      Serial.println("ERROR: no se pudo leer AS5600 #3 para calibrar.");
      return;
    }
    crudo &= 0x0FFF;
    offsetRaw3 = (4096 - crudo) & 0x0FFF;
    resetPosicionAcumulada3(0);
    guardarOffsetRaw(3, offsetRaw3);
    Serial.println("AS5600 #3 calibrado: posicion actual = 0.00 deg, 0 vueltas (offset guardado en flash).");
  }
}

// ---------------- Motores (BTS7960) ----------------

#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
  #define CORE_LEDC_V3 1
#else
  #define CORE_LEDC_V3 0
#endif

const uint32_t PWM_FREQ_HZ    = 20000;
const uint8_t  PWM_RES_BITS   = 8;
// 60 (~23%) resulto insuficiente para vencer la friccion estatica de los
// motores (no arrancaban). 255 (100%) si arranco, confirmado en pruebas.
// Duty minimo aceptado al calibrar velocidades (ver CALVEL mas abajo),
// para no terminar bajando tanto el duty de un motor rapido que deje de
// arrancar.
const uint8_t DUTY_MIN_SEGURO = 90;

// Duty por motor (ya no es un solo valor global): cada motor puede
// necesitar un duty distinto para girar a una velocidad real similar a
// los otros dos, dado que a igual duty no giran igual de rapido. Se
// inicializa en 150 (el valor validado antes de tener CALVEL) y se
// persiste en flash una vez calibrado.
uint8_t velocidadMotor[3] = {150, 150, 150};

int16_t cargarVelocidadMotor(uint8_t indice) {
  char clave[8];
  snprintf(clave, sizeof(clave), "vel%u", indice);
  prefs.begin(NVS_NAMESPACE, true);
  int16_t valor = prefs.getShort(clave, 150); // 150 = valor por defecto si nunca se calibro
  prefs.end();
  return valor;
}

void guardarVelocidadMotor(uint8_t indice, int16_t valor) {
  char clave[8];
  snprintf(clave, sizeof(clave), "vel%u", indice);
  prefs.begin(NVS_NAMESPACE, false);
  prefs.putShort(clave, valor);
  prefs.end();
}

const uint8_t PIN_RPWM[3] = {25, 27, 19};
const uint8_t PIN_LPWM[3] = {26, 18, 23};

#if !CORE_LEDC_V3
const uint8_t CANAL_RPWM[3] = {0, 2, 4};
const uint8_t CANAL_LPWM[3] = {1, 3, 5};
#endif

enum EstadoMotor { PARADO, ADELANTE, REVERSA };
EstadoMotor estadoMotor[3] = {PARADO, PARADO, PARADO};
uint8_t motorActivo = 0;

// Declarado aqui (no junto con el resto del PID mas abajo) porque
// girarAdelante()/girarReversa()/iniciarHoming() necesitan consultarlo
// para rechazar comandos manuales mientras el PID de ese motor este activo.
bool pidActivo[3] = {false, false, false};

void configurarPWM(uint8_t pin, uint8_t canal) {
#if CORE_LEDC_V3
  ledcAttach(pin, PWM_FREQ_HZ, PWM_RES_BITS);
#else
  ledcSetup(canal, PWM_FREQ_HZ, PWM_RES_BITS);
  ledcAttachPin(pin, canal);
#endif
}

void escribirPWM(uint8_t pin, uint8_t canal, uint32_t duty) {
#if CORE_LEDC_V3
  ledcWrite(pin, duty);
#else
  ledcWrite(canal, duty);
#endif
}

uint8_t canalRPWM(uint8_t m) {
#if CORE_LEDC_V3
  return 0;
#else
  return CANAL_RPWM[m];
#endif
}
uint8_t canalLPWM(uint8_t m) {
#if CORE_LEDC_V3
  return 0;
#else
  return CANAL_LPWM[m];
#endif
}

// Posicion acumulada RAW (sin convertir a grados) del encoder emparejado
// con el motor `m` (mapeo confirmado 1-1, 2-2, 3-3).
int32_t leerPosicionAcumRaw(uint8_t m) {
  switch (m) {
    case 0: return as5600_1.getCumulativePosition(false);
    case 1: return as5600_2.getCumulativePosition(false);
    case 2: return posicionAcum3;
    default: return 0;
  }
}

// Guarda en flash la posicion acumulada actual del encoder del motor `m`,
// para poder restaurarla en el proximo arranque (ver setup()).
void guardarPosicionMotor(uint8_t m) {
  guardarPosicionAcum(m + 1, leerPosicionAcumRaw(m));
}

