JosAlc67/DimecaProject/esp32_triple_as5600/Fase7_Integracion_Final/Fase7_Integracion_Final.ino
// Fija el duty de un motor a mano (sin medir nada) y lo persiste en
// flash, igual que CALVEL pero sin el paso de medicion automatica - para
// cuando el ajuste de velocidad se calcula aparte a partir de datos ya
// tomados (ver comando SETVEL<1-3> mas abajo).
void fijarVelocidadMotor(uint8_t m, uint8_t duty) {
  velocidadMotor[m] = duty;
  guardarVelocidadMotor(m + 1, duty);
  Serial.print("Motor ");
  Serial.print(m + 1);
  Serial.print(": duty fijado a mano en ");
  Serial.print(duty);
  Serial.println(" (guardado en flash).");
}

// ---------------- HOME (regreso a 0) - lazo cerrado simple, SIN PID ----------------
//
// Regla fija para los 3 motores, confirmada en hardware: F (adelante)
// RESTA del acumulado y R (reversa) SUMA. Por lo tanto, para volver a 0:
// si el acumulado es NEGATIVO se manda REVERSA (R, que suma y lo acerca
// a 0); si es POSITIVO se manda ADELANTE (F, que resta y lo acerca a 0).
// Se detiene al llegar dentro de la tolerancia. No hay ganancias ni
// ajuste fino de velocidad - es control bang-bang, el mas simple posible.
//
// Mapeo motor->encoder confirmado por el usuario: 1-1, 2-2, 3-3 (sin cruces).
//
// Se mantiene una sola proteccion: si no mejora el error en
// HOMING_MARGEN_PROGRESO_MS, o si se excede HOMING_TIMEOUT_MS en total,
// aborta y detiene el motor - con la regla fija, si esto pasa es señal de
// un problema real (encoder desacoplado, motor sin fuerza, etc.), no de
// un signo mal elegido.

const float    TOLERANCIA_HOMING_DEG     = 3.0f;   // se considera "en home" dentro de esto
const uint32_t HOMING_TIMEOUT_MS         = 20000;  // aborta si tarda mas de esto en total
const uint32_t HOMING_MARGEN_PROGRESO_MS = 4000;   // debe mejorar el error en este tiempo

// Cerca del setpoint se baja la velocidad: a velocidadMotor[m] (tipico
// ~150) el motor sigue girando un poco por inercia despues de cortar el
// PWM, y ese "coast" era buena parte del error final constante que se
// veia en HOME. Con menos velocidad al final, menos inercia, menos
// sobrepaso, y el resultado queda mas cerca de 0.
const float    HOME_ZONA_LENTA_DEG       = 15.0f;
const uint8_t  HOME_DUTY_LENTO           = DUTY_MIN_SEGURO; // 90: ya confirmado como piso seguro

bool homingActivo[3]         = {false, false, false};
uint32_t homingInicio[3]     = {0, 0, 0};
uint32_t homingUltimoProgreso[3] = {0, 0, 0};
float homingMejorError[3]    = {0, 0, 0};
uint8_t homingDutyActual[3]  = {0, 0, 0};

// Lee la posicion acumulada (continua, sin wraparound) en grados del
// encoder correspondiente al motor `m` (0, 1 o 2).
// Mapeo fisico confirmado por el usuario: cada AS5600 esta emparejado con
// su motor del mismo numero (1-1, 2-2, 3-3), sin cruces.
bool leerAnguloAcumuladoGrados(uint8_t m, float &grados) {
  int32_t posRaw;
  bool ok;
  switch (m) {
    case 0: ok = comOk1; posRaw = as5600_1.getCumulativePosition(false); break; // Motor 1 -> AS5600 #1
    case 1: ok = comOk2; posRaw = as5600_2.getCumulativePosition(false); break; // Motor 2 -> AS5600 #2
    case 2: ok = comOk3; posRaw = posicionAcum3; break;                        // Motor 3 -> AS5600 #3
    default: return false;
  }
  if (!ok) return false;
  grados = posRaw * (360.0f / 4096.0f);
  return true;
}

// Escribe PWM directo con sentido y duty elegidos, para HOME. A
// diferencia de girarAdelante()/girarReversa() (que siempre usan
// velocidadMotor[m] fijo), este permite bajar la velocidad cerca del
// setpoint sin pasar por el guard de "debe estar PARADO" de esas
// funciones - HOME ya controla el flujo por su cuenta.
void homingMover(uint8_t m, bool adelante, uint8_t duty) {
  if (adelante) {
    escribirPWM(PIN_LPWM[m], canalLPWM(m), 0);
    escribirPWM(PIN_RPWM[m], canalRPWM(m), duty);
    estadoMotor[m] = ADELANTE;
  } else {
    escribirPWM(PIN_RPWM[m], canalRPWM(m), 0);
    escribirPWM(PIN_LPWM[m], canalLPWM(m), duty);
    estadoMotor[m] = REVERSA;
  }
}

void detenerHoming(uint8_t m, const char *motivo) {
  homingActivo[m] = false;
  detenerMotor(m);
  Serial.print("Motor ");
  Serial.print(m + 1);
  Serial.print(": HOME ");
  Serial.println(motivo);
}

void iniciarHoming(uint8_t m) {
  if (pidActivo[m]) {
    Serial.print("Motor ");
    Serial.print(m + 1);
    Serial.println(": RECHAZADO - PID activo en este motor, manda S primero.");
    return;
  }
  if (estadoMotor[m] != PARADO) {
    Serial.print("Motor ");
    Serial.print(m + 1);
    Serial.println(": RECHAZADO - detenlo (S) antes de iniciar HOME.");
    return;
  }
  float grados;
  bool ok = leerAnguloAcumuladoGrados(m, grados);
  if (!ok) {
    Serial.print("Motor ");
    Serial.print(m + 1);
    Serial.println(": RECHAZADO - encoder sin comunicacion, no se puede iniciar HOME.");
    return;
  }
  homingActivo[m] = true;
  homingInicio[m] = millis();
  homingUltimoProgreso[m] = millis();
  homingMejorError[m] = fabs(grados);
  homingDutyActual[m] = 0;
  Serial.print("Motor ");
  Serial.print(m + 1);
  Serial.print(": iniciando HOME desde ");
  Serial.print(grados, 2);
  Serial.println(" deg...");
}

// Se llama en CADA iteracion de loop() para los motores con homing activo.
void actualizarHoming(uint8_t m) {
  if (!homingActivo[m]) return;

  float grados;
  if (!leerAnguloAcumuladoGrados(m, grados)) {
    detenerHoming(m, "ABORTADO - se perdio comunicacion con el encoder.");
    return;
  }

  float errorAbs = fabs(grados);

  if (errorAbs <= TOLERANCIA_HOMING_DEG) {
    homingActivo[m] = false;
    detenerMotor(m);
    Serial.print("Motor ");
    Serial.print(m + 1);
    Serial.print(": HOME alcanzado, posicion final = ");
    Serial.print(grados, 2);
    Serial.println(" deg.");
    return;
  }

  if (millis() - homingInicio[m] > HOMING_TIMEOUT_MS) {
    detenerHoming(m, "ABORTADO - tiempo limite excedido.");
    return;
  }

  if (errorAbs < homingMejorError[m] - 0.5f) {
    homingMejorError[m] = errorAbs;
    homingUltimoProgreso[m] = millis();
  } else if (millis() - homingUltimoProgreso[m] > HOMING_MARGEN_PROGRESO_MS) {
    detenerHoming(m, "ABORTADO - no se acerca a 0. Revisa el encoder/acople mecanico.");
    return;
  }

  // Regla fija: negativo -> reversa (R, suma), positivo -> adelante (F, resta).
  bool debeIrAdelante = (grados > 0);
  EstadoMotor direccionDeseada = debeIrAdelante ? ADELANTE : REVERSA;
  uint8_t dutyDeseado = (errorAbs <= HOME_ZONA_LENTA_DEG) ? HOME_DUTY_LENTO : velocidadMotor[m];

  if (estadoMotor[m] != direccionDeseada) {
    if (estadoMotor[m] != PARADO) detenerMotor(m);
    homingMover(m, debeIrAdelante, dutyDeseado);
    homingDutyActual[m] = dutyDeseado;
  } else if (dutyDeseado != homingDutyActual[m]) {
    // Mismo sentido, solo se entra/sale de la zona lenta - no hace falta
    // detenerse primero para esto.
    homingMover(m, debeIrAdelante, dutyDeseado);
    homingDutyActual[m] = dutyDeseado;
  }
}

// ---------------- PID real por motor (identificado con System Identification Toolbox) ----------------
//
// Ganancias obtenidas por el usuario en MATLAB a partir de las plantas
// identificadas con SysID_Motor.ino (una funcion de transferencia
// posicion(deg)/duty por motor, ver esa carpeta). A diferencia de HOME
// (bang-bang, velocidad fija, se detiene al llegar), este PID escribe un
// duty CONTINUO y con signo, proporcional al error - no pasa por
// girarAdelante()/girarReversa() ni por la maquina de estados de esas
// funciones, porque un PID bien sintonizado cruza el cero de salida de
// forma suave conforme se acerca al setpoint, sin el "cambio brusco de
// sentido a velocidad fija" que esa maquina de estados esta pensada para
// evitar en el modo manual/bang-bang.
//
// IMPORTANTE sobre el signo de Kp: las 3 ganancias son NEGATIVAS. Esto es
// correcto, no un error de MATLAB: ya se confirmo en hardware (ver HOME)
// que "adelante" (duty positivo) RESTA del acumulado y "reversa" SUMA -
// es decir la planta identificada tiene ganancia negativa. Para que la
// realimentacion sea efectivamente negativa (estabilizante), el
// controlador necesita ganancia negativa tambien. Los signos coinciden
// exactamente con lo que ya se sabia del hardware.
//
// Se dejan anotados los valores de P y PD por si se quieren probar en
// vez del PID completo (bastaria con poner Ki=0 y/o Kd=0 en el arreglo).
//
// --- Motor 1 ---   P: Kp=-54.708699 | PD: Kp=-2.096146, Kd=0.000000
// --- Motor 2 ---   P: Kp=-77.922487 | PD: Kp=-2.120143, Kd=0.000000
// --- Motor 3 ---   P: Kp=-77.537923 | PD: Kp=-2.264696, Kd=0.000000

