JosAlc67/DimecaProject/esp32_triple_as5600/Fase7_Integracion_Final/Fase7_Integracion_Final.ino
struct GananciasPID { float Kp; float Ki; float Kd; };

GananciasPID pidMotor[3] = {
  {-2.080548f, -0.420325f, -0.165080f}, // Motor 1 (PID completo)
  {-2.086742f, -0.374856f, -0.150000f}, // Motor 2 (Kd=0 tal cual identificado en MATLAB; se
                                         // agrega -0.15 a mano como punto de partida SIN
                                         // VALIDAR, tomando de referencia el Kd de Motor 1/3
                                         // que tienen Kp/Ki similares. Sin derivativo el motor
                                         // cabeceaba bastante antes de llegar al setpoint - el
                                         // termino derivativo es justo el que amortigua eso.
  {-2.249454f, -0.441603f, -0.179295f}  // Motor 3 (PID completo)
};

const uint32_t PID_INTERVALO_MS = 20;    // ciclo de control: 50 Hz
const float    PID_SALIDA_MAX   = 255.0f; // mismas unidades (duty 0-255) que uso la identificacion

// Piso de friccion estatica: en Fase 6 se confirmo que duty=60 (~23%) NO
// alcanza a arrancar estos motores, y duty=150 (~59%) si. Sin este piso, al
// achicarse el error el PID pide una salida chica que nunca mueve el motor
// - se queda "pegado" esperando a que el integral se infle solo, que es
// justo el error lento y persistente que se vio en las pruebas. VALOR SIN
// VALIDAR EN HARDWARE TODAVIA (punto de partida entre 60 y 150): si el
// motor sigue sin arrancar cerca del setpoint, subelo; si pica/vibra
// demasiado, bajalo.
const uint8_t  PID_DUTY_MIN_FRICCION = 80;

// Dentro de esta banda alrededor del setpoint se considera "llegado": el
// AS5600 ya tiene ~1.5 deg de error de linealidad propio, asi que perseguir
// un error menor que eso es perseguir ruido del sensor, no error real - y
// con el piso de friccion de arriba, insistir ahi solo logra que el motor
// pique sin asentarse nunca.
const float    PID_ZONA_MUERTA_DEG = 1.5f;

float    pidSetpoint[3]      = {0, 0, 0}; // grados, en la misma escala continua "acumulado"
float    pidIntegral[3]      = {0, 0, 0};
float    pidErrorAnterior[3] = {0, 0, 0};
uint32_t pidUltimoTiempo[3]  = {0, 0, 0};

// Escribe un duty CON SIGNO en el motor `m`: positivo = adelante (RPWM),
// negativo = reversa (LPWM), 0 = detenido. Bypassa girarAdelante()/
// girarReversa() a proposito (ver nota arriba), pero si actualiza
// estadoMotor[] para que STATUS y el resto del sistema lo reporten bien.
void escribirComandoMotor(uint8_t m, float u) {
  float magnitud = fabs(u);
  if (magnitud > PID_SALIDA_MAX) magnitud = PID_SALIDA_MAX;
  uint8_t duty = (uint8_t)magnitud;

  if (u > 0.0f) {
    escribirPWM(PIN_LPWM[m], canalLPWM(m), 0);
    escribirPWM(PIN_RPWM[m], canalRPWM(m), duty);
    estadoMotor[m] = ADELANTE;
  } else if (u < 0.0f) {
    escribirPWM(PIN_RPWM[m], canalRPWM(m), 0);
    escribirPWM(PIN_LPWM[m], canalLPWM(m), duty);
    estadoMotor[m] = REVERSA;
  } else {
    escribirPWM(PIN_RPWM[m], canalRPWM(m), 0);
    escribirPWM(PIN_LPWM[m], canalLPWM(m), 0);
    estadoMotor[m] = PARADO;
  }
}

void iniciarPID(uint8_t m, float setpointDeg) {
  if (homingActivo[m]) {
    Serial.print("Motor ");
    Serial.print(m + 1);
    Serial.println(": RECHAZADO - HOME activo en este motor, manda S primero.");
    return;
  }
  if (estadoMotor[m] != PARADO) {
    Serial.print("Motor ");
    Serial.print(m + 1);
    Serial.println(": RECHAZADO - detenlo (S) antes de iniciar PID.");
    return;
  }
  float actual;
  if (!leerAnguloAcumuladoGrados(m, actual)) {
    Serial.print("Motor ");
    Serial.print(m + 1);
    Serial.println(": RECHAZADO - encoder sin comunicacion, no se puede iniciar PID.");
    return;
  }
  pidSetpoint[m]      = setpointDeg;
  pidIntegral[m]      = 0.0f;
  pidErrorAnterior[m] = setpointDeg - actual;
  pidUltimoTiempo[m]  = millis();
  pidActivo[m]        = true;
  Serial.print("Motor ");
  Serial.print(m + 1);
  Serial.print(": PID activo, setpoint=");
  Serial.print(setpointDeg, 2);
  Serial.print(" deg (actual=");
  Serial.print(actual, 2);
  Serial.println(" deg)");
}

void detenerPID(uint8_t m) {
  pidActivo[m] = false;
  detenerMotor(m);
}

// Se llama en CADA iteracion de loop() para los motores con PID activo.
// Internamente se autolimita a PID_INTERVALO_MS (no necesita otro control
// de tiempo por fuera).
void actualizarPID(uint8_t m) {
  if (!pidActivo[m]) return;

  uint32_t ahora = millis();
  if (ahora - pidUltimoTiempo[m] < PID_INTERVALO_MS) return;
  float dt = (ahora - pidUltimoTiempo[m]) / 1000.0f;
  pidUltimoTiempo[m] = ahora;

  float actual;
  if (!leerAnguloAcumuladoGrados(m, actual)) {
    Serial.print("Motor ");
    Serial.print(m + 1);
    Serial.println(": PID ABORTADO - se perdio comunicacion con el encoder.");
    detenerPID(m);
    return;
  }

  float error = pidSetpoint[m] - actual;

  if (fabs(error) <= PID_ZONA_MUERTA_DEG) {
    // Ya llegamos (dentro del margen de ruido del sensor): no seguir
    // forzando el motor contra su propia friccion estatica por una
    // fraccion de grado que ademas no se puede medir con certeza.
    pidErrorAnterior[m] = error;
    escribirComandoMotor(m, 0.0f);
    return;
  }

  float integralTentativa = pidIntegral[m] + error * dt;
  float derivada = (dt > 0.0f) ? (error - pidErrorAnterior[m]) / dt : 0.0f;

  GananciasPID &g = pidMotor[m];
  float salida = g.Kp * error + g.Ki * integralTentativa + g.Kd * derivada;

  // Anti-windup simple: si la salida ya esta saturada, no sigue acumulando
  // el termino integral (evita que el integrador se "infle" sin limite
  // mientras el motor de todos modos no puede ir mas rapido).
  if (salida > PID_SALIDA_MAX || salida < -PID_SALIDA_MAX) {
    salida = constrain(salida, -PID_SALIDA_MAX, PID_SALIDA_MAX);
  } else {
    pidIntegral[m] = integralTentativa;
  }

  // Piso de friccion: si el PID pide movimiento pero por debajo del duty
  // que vence la friccion estatica, subirlo a ese piso (conservando el
  // signo) - si no, el motor nunca arranca cerca del setpoint.
  if (salida > 0.0f && salida < (float)PID_DUTY_MIN_FRICCION) {
    salida = (float)PID_DUTY_MIN_FRICCION;
  } else if (salida < 0.0f && salida > -(float)PID_DUTY_MIN_FRICCION) {
    salida = -(float)PID_DUTY_MIN_FRICCION;
  }

  pidErrorAnterior[m] = error;
  escribirComandoMotor(m, salida);
}

// Imprime el estado de los 3 encoders bajo demanda (comando STATUS), en vez
// de hacerlo automaticamente cada cierto tiempo - eso generaba demasiado
// ruido visual en el Monitor Serial.
void imprimirEstadoCompleto() {
  bool imanOk1 = comOk1 && as5600_1.magnetDetected();
  bool imanOk2 = comOk2 && as5600_2.magnetDetected();
  uint8_t st3 = 0;
  bool imanOk3 = comOk3 && leerReg8_bus3(AS5600_REG_STATUS, st3) && (st3 & AS5600_STATUS_MD);

  imprimirPosicion("AS5600 #1", comOk1, as5600_1.getCumulativePosition(false), as5600_1.getRevolutions(), imanOk1);
  imprimirPosicion("AS5600 #2", comOk2, as5600_2.getCumulativePosition(false), as5600_2.getRevolutions(), imanOk2);
  imprimirPosicion("AS5600 #3", comOk3, posicionAcum3, revoluciones3(), imanOk3);

